import React from "react";
import Grid from "@mui/material/Grid";
import Divider from "@mui/material/Divider";

// @mui icons
import FacebookIcon from "@mui/icons-material/Facebook";
import TwitterIcon from "@mui/icons-material/Twitter";
import InstagramIcon from "@mui/icons-material/Instagram";

// Material Dashboard 2 React components
import Box from "@mui/material/Box";
import Typography from "@mui/material/Typography";

// Material Dashboard 2 React example components
import DashboardLayout from "examples/LayoutContainers/DashboardLayout";
import DashboardNavbar from "examples/Navbars/DashboardNavbar";
import Footer from "examples/Footer";
import ProfileInfoCard from "examples/Cards/InfoCards/ProfileInfoCard";
import ProfilesList from "layouts/guid/list";
// Overview page components
import Header from "layouts/guid/components/Header";
// import PlatformSettings from "layouts/profile/components/PlatformSettings";
import MDBox from "components/MDBox";
import MDTypography from "components/MDTypography";
// Data
import profilesListData from "layouts/profile/data/profilesListData";
import BasicModal from "./modal";

// Images
function Guid() {
  const [open, setOpen] = React.useState(false);
  const handleOpen = () => setOpen(true);
  const handleClose = () => setOpen(false);
  return (
    <DashboardLayout>
      <DashboardNavbar />
      <Header handleOpen={handleOpen}>
        <Box mb={2} />
        <Grid container spacing={1}>
          <Grid item xs={12} xl={12}>
            <MDBox px={2}>
              <MDTypography
                variant="h6"
                fontWeight="medium"
                textTransform="capitalize"
              >
                راهنما و قوانین و مقررات
              </MDTypography>
            </MDBox>
            <MDBox p={2}>
              <h5>ماده 1 - تعاریف و اصطالحات</h5>
              <p style={{ fontSize: "12px" }}>
                هاگ بار: سامانه جامع ارائه دهنده خدمات الکترونیکی حمل و نقل شهری
                و بین شهری گفته می شود که خدمات نرمافزاری برای حمل و نقل کاال و
                اثاثیه منزل در محدوده برون شهری و یا درون شهری ارائه می دهد. هاگ
                بار سامانه خدمات نرم افزاری است که برای حمل و نقل کاال در محدوده
                برونشهری یا درونشهری ارائه می شود.
                <br></br>
                سفارش دهنده: هر شخص حقیقی یا حقوقی است که در اپلیکیش هاگ بار به
                منظور ارسال درخواست حمل و نقل کاال ثبت نام نموده اند.
                <br></br>
                گیرنده: اشخاص حقیقی یا حقوقی که توسط کاربر سفارش دهنده به عنوان
                گیرنده بار معرفی می گردد.
                <br></br>
                راننده: شخص حقیقی است که در سامانه هاگ بار به منظور دریافت
                درخواست حمل ونقل کاال و ارائه خدمات، ثبتنام نموده است و یا به
                رانندگانی که توسط موسسات و شرکتهای حمل و نقل کاربر اعزام می
                شوند، اطالق می گردد.
                <br></br>
                بار: عبارت است از محمولهای که توسط باربری، بنابر تقاضای سفارش
                دهنده، حمل و نقل کاال به گیرنده تحویل داده شود.
                <br></br>
                کاربر یا کاربران: اشخاص حقیقی و یا حقوقی اعم از راننده و یا
                سفارش دهنده حمل ونقل کاال و موسسات و شرکتهای حمل و نقل که از
                طریق فضای مجازی به سامانه هاگ بار متصل و از خدمات این نرم افزار
                استفاده می نمایند.
                <br></br>
                بارنامه: مطابق ماده 2 قانون الزام شرکتها و موسسات ترابری جادهای
                به استفاده از صورت وضعیت مسافری و بارنامه، سند کاشف از حقوق
                مالکیت بوده و طرح آن در دو نوع برای حمل و نقل کاالهای عمومی و
                حمل و نقل فرآوردههای نفتی بوده و به صورت تمبردار و یا الصاق توسط
                شرکت حمل و نقل به صورت الکترونیکی توسط شرکتها و موسسات حمل و نقل
                مجاز و قانونی طبق تشریفات قید شده در ماده مرقوم صادر میگردد.
                <br></br> حواله بارنامه: برگه ایست که به موجب ماده 2 قانون الزام
                شرکتها و موسسات ترابری جادهای به استفاده از صورت وضعیت مسافری و
                بارنامه توسط اداره کل استان یا نمایندگی ادارات کل در اختیار
                شرکتها و یا موسسات حمل و نقل جاده ای داخلی کاال یا نمایندگان آن
                قرار خواهد گرفت.
                <br></br> کاربر شرکت حمل و نقل: هر شرکت و موسسات حمل و نقل که به
                منظور صدور بارنامه و یا پذیرش سفارش حمل و نقل کاال در سامانه هاگ
                بار ثبت نام نموده اند.
                <br></br> اعتبار: مبلغی است که کاربران در حساب کاربری خود به
                منظور استفاده از خدمات هاگ بار کارسازی می نمایند. این مبلغ به
                صورت پرداخت از طریق سامانه بانکی و کارتهای عضو شتاب منظور و
                محاسبه می شود.
                <br></br> اطالعات محرمانه: اطالعاتی که توسط اشخاص و یا موسسات
                حمل و نقل بار در اختیار هاگ بار قرار می گیرد، اعم از اطالعاتی که
                از سوی کاربران وارد می شود و همچنین اطالعاتی که بصورت خودکار و
                در نتیجه استفاده از خدمات هاگ بار در اختیار هاگ بار قرار داده می
                شود.
                <br></br> قوانین الزم االجرا: قانون اساسی، قوانین عادی، آیین
                نامهها و بخشنامههای قانونی حاکم بر انجام موضوع تفاهمنامه و ضوابط
                و مقرراتی که توسط شرکت اعالم می گردد.
                <br></br> حساب کاربری: حسابی است که اشخاص برای استفاده از خدمات
                هاگ بار در این سامانه ایجاد نموده اند.
              </p>
              <h5>ماده 2 - حقوق و تعهدات کاربر/کاربران</h5>
              <p style={{ fontSize: "12px" }}>
                کاربر تعهد نمود حق اقدام و یا تکمیل به هر گونه اقتباس و یا تکثیر
                و یا تقلید و یا شبیه سازی و یا کپی یرداری از بازارگاه الکترونیکی
                هاگ بار و اپلیکیشن های مربوط به آن را چه توسط خود و چه توسط
                اشخاص حقوقی و حقیقی ثالث را نخواهد داشت. <br></br>
                کاربر تعهد نمود حق هیچگونه اقدام و عملیاتی را به منظور دسترسی به
                سرور و برنامه های مبدا شرکت را نخواهد داشت مگر در مواردی که شرکت
                صالح بداند. <br></br>
                صاحبان بار در طول مدت زمان عضویت خود نمی توانند از نرم افزار
                هایی که در حوزه حمل و نقل کاال ) بار( برون شهری که خدماتی مشابه
                با هاگ بار ارائه می نمایند، استفاده نمایند. <br></br>
                کابر به منظور تحقق بدون ایراد این تفاهم نامه ملزم و متعهد به
                اجرای کامل قوانین موضوعه کشور و نیز روش ها و دستورالعمل ها و
                آیین نامه های اجرایی مصوب سازمان راهداری و پایانه جاده ای کشور و
                شورای عالی انفورماتیک و سایر ارگان های قانونی و نیز ضوابط و
                مقررات شرکت شد. <br></br>
                کاربر می بایست اطالعات خواسته شده را به صورت صحیح و به روز در
                اپلیکیشن هاگ بار وارد نماید و در صورت تخلف از مفاد این بند
                نامبرده مسئول عدم صحت و بروز هرگونه خسارت و ضرر و زیان به هر شکل
                و به هر عنوان می باشد. <br></br>
                کاربر قبول نمود در نهایت هوشیاری و با رعایت نکات ایمنی از
                اطالعات حساب کاربری خود محافظت و نگهداری نماید و در صورت سرقت و
                یا مفقود شدن اطالعات مزبور در اولین فرصت این امر را به شرکت کتبا
                اطالع دهد. <br></br>
                کاربر پذیرفت هر گونه رویه و یا اَشکال و عبارات مبین تائید و
                اعالم قبولی و تصدیق داده پیام های صادره از طرف سامانه، به منزله
                امضا الکترونیکی و قبول احتساب خواهد شد و طرح هرگونه ادعایی را در
                این مورد از خود سلب و اسقاط نمود. <br></br>
                چنانچه در اثر اقدامات کاربر، هرگونه خسارت و ضرر و زیان به اعتبار
                و یا نام و یا شهرت تجاری و اجتماعی شرکت وارد آید، نقض این تفاهم
                نامه تلقی و شرکت می تواند حساب کاربری وی را مسدود و اقدام به
                اقامه دعوای در این راستا نماید.
                <br></br>
                کاربر قبول نمود در صورتی که بنا بر تشخیص شرکت، از قوانین و
                مقررات و مواد این تفاهم نامه تخطی نماید و یا هر عمل و رفتاری که
                برای شرکت و یا سایر کاربران و یا اشخاص ثالث خطرناک بوده و یا
                مطلوب نباشد را انجام دهد ، شرکت می تواند حق هرگونه دسترسی کاربر
                را به اپلیکیشن هاگ بار در هر زمان قطع و یا محدود نموده و حساب
                کاربری نامبرده را مسدود نماید. <br></br>
                کاربر متعهد شد به منظور بهره برداری از خدمات هاگ بار صرفا از یک
                حساب کاربری استفاده نماید و چنانچه ثابت شود نامبرده از یک حساب
                کاربری دیگری استفاده نموده است و یا می نماید، شرکت می تواند حق
                دسترسی به بازارگاه الکترونیکی 3 هاگ بار را بابت هر دو حساب
                کاربری قطع نماید. <br></br>
                کاربر به این امر مشرف گردید که بازارگاه الکترونیکی هاگ بار صرفا
                یک نرم افزار می باشد که شرایط و مولفه های یک توافق، فی مابین
                کاربران را در فضای مجازی فراهم می نماید.
                <br></br>
                کاربر تعهد نمود از انجام هرگونه فعالیت که برخالف قوانین الزم
                االتباع جمهوری اسالمی ایران بوده و یا برخالف اصل حسن نیت و یا
                عرف جامعه و یا شرع مبین اسالم می باشد از طریق بازارگاه
                الکترونیکی هاگ بار خودداری نماید.
                <br></br>
                پرداخت هر گونه حقوق و مسئولیت های قانونی عوامل انسانی و سخت
                افزاری و نرم افزاری متعلق به کاربر بنابر اقتضا و موضوعیت داشتن
                موارد این بند ) مانند موسسات و شرکت های حمل و نقل ( بعهده
                نامبرده می باشد و شرکت در این خصوص مبرا از هرگونه مسئولیت بوده و
                این امر مورد قبول کاربران مورد نظر قرار گرفت. <br></br>
                کاربر به موجب این تفاهم نامه متهد به رعایت کلیه قوانین و آیین
                نامه ها و بخشنامه های مرتبط با حوزه حمل و نقل جاده ای کاال و
                سایر مقرراتی که توسط هر یک از مراجع ذی صالح در این حوزه و همچنین
                سایر زمینه های مربوط به کسب و کار کاربر بنابر مورد اصدار یافته
                است، شد؛ و چنانچه به علت عدم رعایت هریک از قوانین و مقررات الزم
                االجرا به شرکت خسارتی مادی یا معنوی وارد شود و در اینخصوص شرکت
                به موجب آرای قطعی از سوی مراجع قضایی و قانونی محکوم به پرداخت
                مبلغی شود ، کاربر عالوه بر جبران خسارت و پرداخت خسارت وارده باید
                %20 از مبلغ آورده در احکام را به عنوان خسارت در وجه شرکت پرداخت
                بنماید. <br></br>
                کاربر اقرار نمود و پذیرفت که با عضویت در هاگ بار می تواند از
                خدمات موجود در آن به نحو غیر انحصاری و غیر قابل انتقال و محدود
                تا حدی که شرکت صالح می داند استفاده نماید و طرح هرگونه ادعای
                مالکیت مادی و یا معنوی نسبت به بازارگاه الکترونیکی هاگ بار را به
                هر شکل و به هر عنوان از خود سلب و اسقاط نمود. <br></br>
                این امر مورد توافق و پذیرش کاربر قرار گرفت، هرگونه مبلغی که در
                راستای طرح های تشویقی و یا تبلیغاتی در حساب کاربری متعلق به آنان
                توسط شرکت کارسازی میشود صرفا قابل استفاده در خدمات ارائه شده و
                شونده در اپلیکیشن هاگ بار می باشد، فلذا قابل انتقال به هر شخص
                حقیقی و حقوقی ویا قابل برداشت و مطالبه به نحو نقدی و غیر نقدی و
                یا معادل نمی باشد. و قابل ذکر است چنانچه کدهایی الکترونیکی جهت
                افزایش و یا کاهش هزینه خدمات حمل و نقل کاال برای کاربران از سوی
                شرکت تعلق گرفته باشد هیچ حق مکتسب و یا مالکیت برای نامبردگان
                بوجود نمی آورد و مع الوصف چون در این خصوص وجه و مبلغی از کاربران
                دریافت نمیشود شرکت می تواند بنا بر هر علت و یا بنا بر اختیار
                صالحدیدی خود مبلغ یا تاثیر کدهای مذکور را تغییر و یا غیر قابل
                استفاده و یا باطل نماید ؛ حتی اگر این اقدام شرکت پس از ارسال و
                یا انتشار کدهای مذکور به کاربران باشد.<br></br>
                کاربران بدین وسیله اقرار نمودند و پذیرفتند کلیه ی اطالعات و
                مشخصات و پیامهایی که از طریق ساخت حساب کاربری خود و به تبع آن
                عضویت در اپلیکیشن هاگ بار در اختیار شرکت قرار می دهند منتسب به
                خود بوده و صحت آنها را چه در حال و چه در آینده با مورد قبول قرار
                دادن این تفاهم نامه مورد تائید قرار دادند فلذا حق هرگونه اعتراض
                و ادعایی را علی الخصوص ادعای جعل نسبت به داده پیام های ارسالی و
                ثبتی را به هر شکل و به هر عنوان در هریک از مراجع قضایی از خود
                سلب و اسقاط نمودند. <br></br>
                کاربر متعهد شد به منظور عضویت و استفاده از خدمات بازارگاه
                الکترونیکی هاگ بار هرگونه اطالعاتی را که توسط شرکت از طریق
                اپلیکیشن هاگ بار به هنگام ثبت نام و یا پس از آن و بنا به هر علت
                را مطالبه می نماید در حساب کاربری خود ثبت نماید.
                <br></br>
                کاربران پذیرفتند و قبول نمودند چنانچه در اثر اعمال و افعال
                نامبردگان که ناشی از عدم رعایت قوانین الزم االجرای جمهوری اسالمی
                ایران و یا آیین نامه ها و یا دستور العمل ها و یا بخش نامه های
                الزم االتباع اصداری از سوی نهادهای عمومی و قانونی متولی حمل و
                نقل کاال و یا کسب و کار اینترنتی مانند قانون جرایم رایانه ای
                )جاسوسی و شنود رایانه ای و یا تخریب و اخالل در در داده ها یا
                سامانه های رایانه ای و مخابراتی و سرقت و کالهبرداری مرتبط با
                رایانه ( و قانون مجازات عاملین متخلف در امر حمل و نقل کاال و
                قانون مجازات اسالمی )ارتکاب جرم در هنگام سفر ( و قوانین مدنی
                )ورود خسارات به اموال صاحبین کاال و یا اشخاص ثالث ( و سایر
                قوانین الزم االتباع هرگونه خسارت از اعم مادی ویا معنوی به شرکت و
                سایر کاربران و یا اشخاص ثالث وارد شود؛ شرکت عالوه بر اینکه
                هیچگونه مسئولیت و تعهدی در قبال اعمال و افعال و خسارات مارالذکر
                را نخواهد داشت بلکه می تواند جهت احقاق حقوق تضییع شده و شهرت
                تجارتی خود اقدامات قانونی و قضائی را علیه کاربر متخلف به هر شکل
                و به هر عنوان به عمل آورده و اقدام به قطع دسترسی کاربر به خدمات
                هاگ بار و مسدود نمودن حساب کاربری وی نماید.
                <br></br>
                کاربران متعهد شدند تمامی درخواست های خود را فقط از طریق نرم
                افزار موبایل و یا تبلت و یا رایانه در اپلیکیشن هاگ بار ثبت و
                پیگیری نماید و روشهایی از قبیل تماس تلفنی، فکس و ... مورد تایید
                نیست.
                <br></br>
                کاربر سفارش دهنده متعهد شد که اقدام به ثبت سفارشی که بر خالف
                قوانین و مقررات الزم االجرا جمهوری اسالمی بوده مانند حمل و نقل
                کاالهای قاچاق و مواد مخدر و کال هرکاالی غیر مجاز و غیر قانونی در
                اپلیکیشن هاگ بار ؛ ننماید و در صورتی که نامبرده بر خالف تکلیف
                مقرر در این بند عمل نماید، شرکت می تواند هرگونه ارائه خدمات به
                وی را به نحو یکطرفه قطع و حساب کاربری او را مسدود نماید و شرکت
                در خصوص موضوع این بند مبرا از هرگونه مسئولیت حقوقی و کیفری می
                باشد
                <br></br>
                کاربر سفارش دهنده مکلف شد به هنگام ثبت سفارش هرگونه اطالعاتی که
                در راستای ارائه ی خدمات حمل و نقل مانند آدرس مبدا؛آدرس مقصد؛ارزش
                کاال و سایر مواردی را که شرکت مطالبه می نماید و تاثیر گذار در
                حمل و کرایه ی حمل و نقل می باشد بارعایت اصل حسن نیت و اصل صحت و
                با رعایت موارد مورد توافق در این تفاهم نامه در اپلیکیشن هاگ بار
                ثبت نماید.
                <br></br>
                کاربر سفارش دهنده به منظور قبول و پذیرش رانندگان جهت بارگیری در
                مبدا و تخلیه در مقصد متعهد به انجام و هماهنگی های الزم و ضروری
                با عوامل خویش و تحویل گیرنده شد.
                <br></br>
                کاربر سفارش دهنده می بایست به هنگام بارگیری، شخصا و یا توسط
                نماینده خود هویت راننده وسیله ی نقلیه را که در اپلیکیشن هاگ بار
                مشخصات هریک ثبت شده است را احراز نموده و در محل بارگیری حضور
                داشته باشد.
                <br></br>
                کاربر متعهد شد اطالعات خواسته شده را به صورت صحیح و درست و مطابق
                با واقعیت، در اپلیکیشن هاگ بار ثبت نماید و در صورت تخلف، نامبرده
                مسئول عدم صحت اطالعات ثبت شده به هر شکل و به هر عنوان می باشد و
                شرکت در این خصوص فاقد هرگونه مسئولیت حقوقی و کیفری خواهد بود.
                <br></br>
                کاربران مکلف هستند در نهایت امانت داری تمامی درخواست های مرتبط
                با حوزه حمل و نقل را که به واسطه ی استفاده از بازرارگاه
                الکترونیکی هاگ بار برای نامبردگان ارسال شده و در اپلیکیشن هاگ
                بار ثبت میگردد قبول و یا قبل از قبول لغو نمایند و با دسترسی به
                اطالعات کاربر سفارش دهنده هیچ گونه اقدام به انجام خدمات حمل و
                نقل خارج از اپلیکیشن هاگ بار را به عمل نیاورند و چنانچه خالف
                مفاد این بند به هرشکل برای شرکت محرز گردد؛ شرکت می تواند عالوه
                بر قطع ارائه خدمات اپلیکیشن هاگ بار و انسداد حساب کاربری شخص
                متخلف مبلغی را بنا بر تشخیص و نظر خود از نامبرده مطالبه و یا از
                حساب کاربری شخص متخلف برداشت نماید و همچنین شرکت می تواند به
                منظور احقاق حقوق خود در هریک از مراجع قضایی اقدام به طرح هرگونه
                ادعا و یا دعوایی را نماید.در خصوص هرگونه توافق و یا وعده که خارج
                از بازارگاه الکترونیکی حمل و نقل جاده ای هاگ بار صورت پذیرد شرکت
                فاقد هرگونه مسئولیت حقوقی و کیفری خواهد بودو کاربر در خصوص تحقق
                یا عدم تحقق مفاد این بند هر گونه حق و ادعایی را به هر عنوان از
                خود سلب و اسقاط نمود.
                <br></br>
                در صورتی که یک فرد با مشخصات هویتی معین ، همزمان به عنوان کاربر
                سفارش دهنده برای یک حمل بار درخواست ثبت نماید و همان فرد ، این
                درخواست را به عنوان کاربر راننده قبول نماید ،این عمل تقلب محسوب
                شده و شرکت حق خواهد داشت مبلغی معادل %60 از کرایه حمل و نقل آن
                سفارش را به عنوان وجه التزام عمل متقلبانه از کاربر مذکور مطالبه
                و یا به همان میزان از موجودی اعتبار نامبرده در حساب کاربری
                برداشت نماید و نیز اقدام به انسداد حساب کاربری مشارالیه
                نماید.ذکر می گردد در صورتی که وابستگان و آشنایان یک فرد با
                همکاری یکدیگر اقدام به اعمال مشابه موصوف نمایند و یا کاربران به
                هر شکل نسبت به شرکت مرتکب به حیله و تقلب شوند و بدین وسیله
                موجبات ضرر مادی و یا معنوی شرکت را فراهم آورند مشمول ضمانت اجرای
                موجود در این بند خواهند بود مرجع تشخیص تقلب شرکت می باشد و
                کاربران حق هرگونه ادعا و دعوایی را در هریک از مراجع قانونی و
                قضائی را در این خصوص به هر شکل و عنوان از خود سلب و ساقط نمودند.
                <br></br>
                شرکت می تواند به منظور ارائه ی خدمات مطلوب به کاربران و نیز
                بررسی کیفیت و نحوه ی عملکرد نامبردگان هر گونه اطالعات و یا داده
                پیام های ثبت شده ی هر یک از کاربران را جمع آوری و تجزیه و تحلیل
                و در راستای اهداف شرکت مورد استفاده قرار دهد و کاربران در این
                خصوص هر گونه اختیاری را به شرکت تفویض و اعطا نموده و طرح هرگونه
                ادعایی را از خود صلب و اسقاط نمودند.
              </p>
              <h5>ماده 3 - حقوق و تعهدات شرکت</h5>
              <p style={{ fontSize: "12px" }}>
                با توجه به خدمات اینترنتی کشور برای دسترسی به خدمات مرکز داده،
                در صورت قطعی و یا اختالل در شبکه اینترنتی و یا اینترانت کشوری،
                شرکت تمام تالش خود را به کار خواهد برد که تا حد ممکن سرویس به
                وضعیت عادی برگردد.
                <br></br>
                نظر به اینکه موضوع تفاهم نامه بر مبنای برنامه های اندروید طراحی
                و اجرا می گردد همزمان با ارتقا سیستم های عامل توسط شرکت های اصلی
                ارائه دهنده برنامه اندروید، شرکت برنامه های موضوع تفاهم نامه را
                به روز رسانی می نماید. قابل بیان است موانع قانونی و یا قضایی و
                یا سراسری مستثنی از این بند می باشد.  شرکت متعهد شد تا در حد
                توان فنی و مالی و استراتژیکی و سیاست های خود، نسبت به تهیه سخت
                افزارها و نرم افزارهای الزم و استقرار آن ها در مرکز داده خود جهت
                ارائه خدمات اقدام نماید.
              </p>
            </MDBox>
          </Grid>
        </Grid>
      </Header>
      {/* <Footer /> */}
    </DashboardLayout>
  );
}

export default Guid;
